Show / Hide Table of Contents
Class CrossSectionComponentThermalData
Cross-section component thermal data
Inheritance
System.Object
CrossSectionComponentThermalData
Inherited Members
 System.Object.ToString()
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: IdeaRS.OpenModel.CrossSection
Assembly: IdeaRS.OpenModel.dll
Syntax
[OpenModelClass("CI.StructModel.Libraries.CrossSection.ComponentThermalDataItem,CI.CrossSection")]
public class CrossSectionComponentThermalData
Properties
Improve this Doc   View Source
ComponentIndex
Zero based index of component
Declaration
public int ComponentIndex { get; set; }
Property Value
 Type |  Description
 System.Int32
Improve this Doc   View Source
MoistureContent
Moisture content
Declaration
public double MoistureContent { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
ThermalConductivityLimit
Thermal conductivity limit
Declaration
public ThermalConductivityLimit ThermalConductivityLimit { get; set; }
Property Value
 Type |  Description
 ThermalConductivityLimit
 Improve this Doc
 View Source